/**/
#ifndef _TIMER_H
#define _TIMER_H

#include "stdint.h"

#define TIMER_1MSEC (96000 - 1)// задержка в 1 мс при 96 МГц

void TIMER1_Handler(void);
/**********************************************************************/	

void TIM_initialization(void);
/**********************************************************************/
/*
   Функция определяет текущее системное время
		Принимает: нет
		Возвращает: системное время в мс 
*/
uint32_t GetTime(void);
/**********************************************************************/
/*
	Процедура сброса таймера
		Принимает: нет
		Возвращает: нет
*/
void TimerReset(void);
/**********************************************************************/
/*	
	Процедера аппаратной задержки
	Принимает: число времени в мс
	Возвращает: нет
*/
void delay_ms(uint32_t);
/**********************************************************************/
#endif
